# Occupation

### Introduction:

Special thanks to: https://github.com/justmarkham for sharing the dataset and materials.

### Step 1. Import the necessary libraries

In [8]:
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user).

### Step 3. Assign it to a variable called users.

In [9]:
users = pd.read_table('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user', 
                      sep='|', index_col='user_id')
users.head()

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

### Step 4. Discover what is the mean age per occupation

In [10]:
users.groupby('occupation').age.mean()

occupation
administrator    38.746835
artist           31.392857
doctor           43.571429
educator         42.010526
engineer         36.388060
entertainment    29.222222
executive        38.718750
healthcare       41.562500
homemaker        32.571429
lawyer           36.750000
librarian        40.000000
marketing        37.615385
none             26.555556
other            34.523810
programmer       33.121212
retired          63.071429
salesman         35.666667
scientist        35.548387
student          22.081633
technician       33.148148
writer           36.311111
Name: age, dtype: float64

### Step 5. Discover the Male ratio per occupation and sort it from the most to the least

In [11]:
# create a function
def gender_to_numeric(x):
    if x == 'M':
        return 1
    if x == 'F':
        return 0

# apply the function to the gender column and create a new column
users['gender_n'] = users['gender'].apply(gender_to_numeric)
print(users)

a = users.groupby('occupation').gender_n.sum() / users.occupation.value_counts() 

# sort to the most male 
a.sort_values(ascending = False)

         age gender     occupation zip_code  gender_n
user_id
1         24      M     technician    85711         1
2         53      F          other    94043         0
3         23      M         writer    32067         1
4         24      M     technician    43537         1
5         33      F          other    15213         0
6         42      M      executive    98101         1
7         57      M  administrator    91344         1
8         36      M  administrator    05201         1
9         29      M        student    01002         1
10        53      M         lawyer    90703         1
11        39      F          other    30329         0
12        28      F          other    06405         0
13        47      M       educator    29206         1
14        45      M      scientist    55106         1
15        49      F       educator    97301         0
16        21      M  entertainment    10309         1
17        30      M     programmer    06355         1
18        35      F          other    37212         0
19        40      M      librarian    02138         1
20        42      F      homemaker    95660         0
21        26      M         writer    30068         1
22        25      M         writer    40206         1
23        30      F         artist    48197         0
24        21      F         artist    94533         0
25        39      M       engineer    55107         1
26        49      M       engineer    21044         1
27        40      F      librarian    30030         0
28        32      M         writer    55369         1
29        41      M     programmer    94043         1
30         7      M        student    55436         1
...      ...    ...            ...      ...       ...
914       44      F          other    08105         0
915       50      M  entertainment    60614         1
916       27      M       engineer    N2L5N         1
917       22      F        student    20006         0
918       40      M      scientist    70116         1
919       25      M          other    14216         1
920       30      F         artist    90008         0
921       20      F        student    98801         0
922       29      F  administrator    21114         0
923       21      M        student    E2E3R         1
924       29      M          other    11753         1
925       18      F       salesman    49036         0
926       49      M  entertainment    01701         1
927       23      M     programmer    55428         1
928       21      M        student    55408         1
929       44      M      scientist    53711         1
930       28      F      scientist    07310         0
931       60      M       educator    33556         1
932       58      M       educator    06437         1
933       28      M        student    48105         1
934       61      M       engineer    22902         1
935       42      M         doctor    66221         1
936       24      M          other    32789         1
937       48      M       educator    98072         1
938       38      F     technician    55038         0
939       26      F        student    33319         0
940       32      M  administrator    02215         1
941       20      M        student    97229         1
942       48      F      librarian    78209         0
943       22      M        student    77841         1

[943 rows x 5 columns]

doctor           1.000000
engineer         0.970149
technician       0.962963
retired          0.928571
programmer       0.909091
executive        0.906250
scientist        0.903226
entertainment    0.888889
lawyer           0.833333
salesman         0.750000
educator         0.726316
student          0.693878
other            0.657143
marketing        0.615385
writer           0.577778
none             0.555556
administrator    0.544304
artist           0.535714
librarian        0.431373
healthcare       0.312500
homemaker        0.142857
dtype: float64

### Step 6. For each occupation, calculate the minimum and maximum ages

In [12]:
users.groupby('occupation').age.agg(['min', 'max'])

               min  max
occupation
administrator   21   70
artist          19   48
doctor          28   64
educator        23   63
engineer        22   70
entertainment   15   50
executive       22   69
healthcare      22   62
homemaker       20   50
lawyer          21   53
librarian       23   69
marketing       24   55
none            11   55
other           13   64
programmer      20   63
retired         51   73
salesman        18   66
scientist       23   55
student          7   42
technician      21   55
writer          18   60

### Step 7. For each combination of occupation and gender, calculate the mean age

In [13]:
users.groupby(['occupation', 'gender']).age.mean()

occupation     gender
administrator  F         40.638889
               M         37.162791
artist         F         30.307692
               M         32.333333
doctor         M         43.571429
educator       F         39.115385
               M         43.101449
engineer       F         29.500000
               M         36.600000
entertainment  F         31.000000
               M         29.000000
executive      F         44.000000
               M         38.172414
healthcare     F         39.818182
               M         45.400000
homemaker      F         34.166667
               M         23.000000
lawyer         F         39.500000
               M         36.200000
librarian      F         40.000000
               M         40.000000
marketing      F         37.200000
               M         37.875000
none           F         36.500000
               M         18.600000
other          F         35.472222
               M         34.028986
programmer     F         32.166667
               M         33.216667
retired        F         70.000000
               M         62.538462
salesman       F         27.000000
               M         38.555556
scientist      F         28.333333
               M         36.321429
student        F         20.750000
               M         22.669118
technician     F         38.000000
               M         32.961538
writer         F         37.631579
               M         35.346154
Name: age, dtype: float64

### Step 8.  For each occupation present the percentage of women and men

In [14]:
# create a data frame and apply count to gender
gender_ocup = users.groupby(['occupation', 'gender']).agg({'gender': 'count'})
print(gender_ocup)
# create a DataFrame and apply count for each occupation
occup_count = users.groupby(['occupation']).count()
print(occup_count)
# divide the gender_ocup per the occup_count and multiply per 100
occup_gender = gender_ocup.div(occup_count, level = "occupation") * 100

# present all rows from the 'gender column'
occup_gender.loc[: , 'gender']
occup_gender.head(50)

                      gender
occupation    gender
administrator F           36
              M           43
artist        F           13
              M           15
doctor        M            7
educator      F           26
              M           69
engineer      F            2
              M           65
entertainment F            2
              M           16
executive     F            3
              M           29
healthcare    F           11
              M            5
homemaker     F            6
              M            1
lawyer        F            2
              M           10
librarian     F           29
              M           22
marketing     F           10
              M           16
none          F            4
              M            5
other         F           36
              M           69
programmer    F            6
              M           60
retired       F            1
              M           13
salesman      F            3
              M            9
scientist     F            3
              M           28
student       F           60
              M          136
technician    F            1
              M           26
writer        F           19
              M           26
               age  gender  zip_code  gender_n
occupation
administrator   79      79        79        79
artist          28      28        28        28
doctor           7       7         7         7
educator        95      95        95        95
engineer        67      67        67        67
entertainment   18      18        18        18
executive       32      32        32        32
healthcare      16      16        16        16
homemaker        7       7         7         7
lawyer          12      12        12        12
librarian       51      51        51        51
marketing       26      26        26        26
none             9       9         9         9
other          105     105       105       105
programmer      66      66        66        66
retired         14      14        14        14
salesman        12      12        12        12
scientist       31      31        31        31
student        196     196       196       196
technician      27      27        27        27
writer          45      45        45        45

                      age      gender  gender_n  zip_code
occupation    gender
administrator F       NaN   45.569620       NaN       NaN
              M       NaN   54.430380       NaN       NaN
artist        F       NaN   46.428571       NaN       NaN
              M       NaN   53.571429       NaN       NaN
doctor        M       NaN  100.000000       NaN       NaN
educator      F       NaN   27.368421       NaN       NaN
              M       NaN   72.631579       NaN       NaN
engineer      F       NaN    2.985075       NaN       NaN
              M       NaN   97.014925       NaN       NaN
entertainment F       NaN   11.111111       NaN       NaN
              M       NaN   88.888889       NaN       NaN
executive     F       NaN    9.375000       NaN       NaN
              M       NaN   90.625000       NaN       NaN
healthcare    F       NaN   68.750000       NaN       NaN
              M       NaN   31.250000       NaN       NaN
homemaker     F       NaN   85.714286       NaN       NaN
              M       NaN   14.285714       NaN       NaN
lawyer        F       NaN   16.666667       NaN       NaN
              M       NaN   83.333333       NaN       NaN
librarian     F       NaN   56.862745       NaN       NaN
              M       NaN   43.137255       NaN       NaN
marketing     F       NaN   38.461538       NaN       NaN
              M       NaN   61.538462       NaN       NaN
none          F       NaN   44.444444       NaN       NaN
              M       NaN   55.555556       NaN       NaN
other         F       NaN   34.285714       NaN       NaN
              M       NaN   65.714286       NaN       NaN
programmer    F       NaN    9.090909       NaN       NaN
              M       NaN   90.909091       NaN       NaN
retired       F       NaN    7.142857       NaN       NaN
              M       NaN   92.857143       NaN       NaN
salesman      F       NaN   25.000000       NaN       NaN
              M       NaN   75.000000       NaN       NaN
scientist     F       NaN    9.677419       NaN       NaN
              M       NaN   90.322581       NaN       NaN
student       F       NaN   30.612245       NaN       NaN
              M       NaN   69.387755       NaN       NaN
technician    F       NaN    3.703704       NaN       NaN
              M       NaN   96.296296       NaN       NaN
writer        F       NaN   42.222222       NaN       NaN
              M       NaN   57.777778       NaN       NaN